package cn.bingai.practice01.demo01;

import java.util.Scanner;

/*
题目：企业发放的奖金根据利润提成。利润(I)低于或等于10万元时，奖金可提10%；
利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可可提成7.5%；
20万到40万之间时，高于20万元的部分，可提成5%；
40万到60万之间时高于40万元的部分，可提成3%；
60万到100万之间时，高于60万元的部分，可提成1.5%，
高于100万元时，超过100万元的部分按1%提成，
从键盘输入当月利润I，求应发放奖金总数？

程序分析：请利用数轴来分界，定位。注意定义时需把奖金定义成长整型。

超过      10万          20万         40万          60万          100万          

10*0.1   10*0.075     20*0.05      20*0.03      40*0.015        0.01

1         1.75          2.75        3.35          3.95    
*/
public class Test12 {
    public static void main(String[] args) {
        System.out.println("请输入当月的利润（万元）：");
        Scanner sc = new Scanner(System.in);
        double I = sc.nextDouble();
        double bonus = 0;//可以用变量存储
        if (I < 0) {
            System.out.println("输入有误，请重新输入！");
        }
        if (I <= 10) {//可写成I >=0 && I <= 10的格式，后面造旧
            bonus = I * 0.1;
            //System.out.println(I * 0.1);
        } else if (I <= 20) {
            bonus = (I - 10) * 0.075 + 10 * 0.1;
            //System.out.println((I - 10) * 0.075 + 10 * 0.1);
        } else if (I <= 40) {
            bonus = (I - 20) * 0.05 + 10 * 0.1 + (20 - 10) * 0.075;
            //System.out.println((I - 20) * 0.05 + 10 * 0.1 + (20 - 10) * 0.075);
        } else if (I <= 60) {
            bonus = (I - 40) * 0.03 + 10 * 0.1 + (20 - 10) * 0.075 + (40 - 20) * 0.05;
            //System.out.println((I - 40) * 0.03 + 10 * 0.1 + (20 - 10) * 0.075 + (40 - 20) * 0.05);
        } else if (I <= 100) {
            bonus = (I - 60) * 0.015 + 10 * 0.1 + (20 - 10) * 0.075 + (40 - 20) * 0.05 + (60 - 40) * 0.03;
            //System.out.println((I - 60) * 0.015 + 10 * 0.1 + (20 - 10) * 0.075 + (40 - 20) * 0.05 + (60 - 40) * 0.03);
        } else {
            bonus = (I - 100) * 0.01 + 10 * 0.1 + (20 - 10) * 0.075 + (40 - 20) * 0.05 + (60 - 40) * 0.03 + (100 - 60) * 0.015;
            //System.out.println((I - 100) * 0.01 + 10 * 0.1 + (20 - 10) * 0.075 + (40 - 20) * 0.05 + (60 - 40) * 0.03 + (100 - 60) * 0.015);
        }
        System.out.println("应该发放的奖金为：" + bonus + "(万元)");
        sc.close();

//        while (!sc.hasNextDouble()) {//判断奖金是否为正数
//            System.out.println("请输入金额数字：");
//            sc.next();
//        }


    }
}
